"Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов."
stroka=input()
kol=stroka.count(' ')+1
print ('количество слов в строке ',kol)